[
  {
    "_id": 1,
    "title": "Data Structure",
    "price": 109.95,
    "description": "A data structure is a specialized format for organizing, processing, retrieving and storing data. There are several basic and advanced types of data structures, all designed to arrange data to suit a specific purpose. Data structures make it easy for users to access and work with the data they need in appropriate ways.",
    "image": "https://wachemo-elearning.net/wp-content/uploads/2021/01/DATA-STRUCTURES-with-Python.png"
  },
  {
    "_id": 2,
    "title": "Algorithms",
    "price": 22.3,
    "description": "An algorithm is a procedure used for solving a problem or performing a computation. Algorithms act as an exact list of instructions that conduct specified actions step by step in either hardware- or software-based routines. Algorithms are widely used throughout all areas of IT.",
    "image": "https://blog-c7ff.kxcdn.com/blog/wp-content/uploads/2019/11/Banner-Blog-1A-1.jpg"
  },
  {
    "_id": 3,
    "title": "System Design",
    "price": 55.99,
    "description": "Systems design is the process of defining elements of a system like modules, architecture, components and their interfaces and data for a system based on the specified requirements.",
    "image": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20191016154609/How-to-Crack-System-Design-Round-in-Interviews.png"
  },
  {
    "_id": 4,
    "title": "Database Design and SQL",
    "price": 15.99,
    "description": "A database is a collection of data organized in tables. A flat database is where all the information about any one event or transaction is stored in a single row in one large single table. However, a database can use Structured Query Language (SQL) to access and update data in an organized fashion.",
    "image": "https://www.entexture.com/wp-content/uploads/2021/02/Enterprise-Architecture-Diagram.png"
  },
  {
    "_id": 5,
    "title": "Logic programming languages",
    "price": 695,
    "description": "Logic programming is a programming paradigm which is largely based on formal logic. Any program written in a logic programming language is a set of sentences in logical form, expressing facts and rules about some problem domain.",
    "image": "https://images.clickittech.com/2020/wp-content/uploads/2022/07/20153103/Top-programing-languajes-image-48.jpg"
  },
  {
    "_id": 6,
    "title": "Scripting languages",
    "price": 168,
    "description": "A scripting language is a programming language that employs a high-level construct to interpret and execute one command at a time. In general, scripting languages are easier to learn and faster to code in than more structured and compiled languages such as C and C++.",
    "image": "https://img.freepik.com/premium-vector/portrait-programmer-working-with-pc_23-2148217001.jpg"
  }
]
